src/test/resources/stub/mappings/inps/ConsultazioneISEEOk.json

{
  "request": {
    "method": "POST",
    "urlPathPattern": "/",
    "headers": {
      "SOAPAction": {
        "equalTo": "\"http://inps.it/ConsultazioneISEE/ISvcConsultazione/ConsultazioneIndicatore\""
      }
    },
    "bodyPatterns": [
      {
        "equalToXml": "<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Header><ns4:Identity xmlns:ns2=\"http://inps.it/ISEERiforma\" xmlns:ns3=\"http://inps.it/ConsultazioneISEE\" xmlns:ns4=\"http://inps.it/\"><UserId>OperationBatchIDPay</UserId><CodiceUfficio>001</CodiceUfficio></ns4:Identity></S:Header><S:Body><ns3:ConsultazioneIndicatore xmlns:ns2=\"http://inps.it/ISEERiforma\" xmlns:ns3=\"http://inps.it/ConsultazioneISEE\" xmlns:ns4=\"http://inps.it/\"><ns3:request> <ns3:TipoIndicatore>Ordinario</ns3:TipoIndicatore><ns3:RicercaCF><ns3:CodiceFiscale>CF_OK</ns3:CodiceFiscale><ns3:PrestazioneDaErogare>A1.01</ns3:PrestazioneDaErogare><ns3:ProtocolloDomandaEnteErogatore>Protocol</ns3:ProtocolloDomandaEnteErogatore><ns3:StatodomandaPrestazione>Da Erogare</ns3:StatodomandaPrestazione></ns3:RicercaCF></ns3:request></ns3:ConsultazioneIndicatore></S:Body></S:Envelope>"
      }
    ]
  },
  "response": {
    "status": "200",
    "body": "<s11:Envelope xmlns:s11='http://schemas.xmlsoap.org/soap/envelope/'>\n<s11:Body>\n<ns1:ConsultazioneIndicatoreResponse xmlns:ns1='http://inps.it/ConsultazioneISEE'><!-- optional --><ns1:ConsultazioneIndicatoreResult><ns1:IdRichiesta>?999?</ns1:IdRichiesta><!-- possible value: OK, possible value: RICHIESTA_INVALIDA, possible value: DATI_NON_TROVATI, possible value: DATABASE_OFFLINE, possible value: ERRORE_INTERNO, possible value: RISCONTRO_NON_VALIDO --><ns1:Esito>OK</ns1:Esito><!-- optional --><ns1:DescrizioneErrore>?XXX?</ns1:DescrizioneErrore><!-- optional --><ns1:XmlEsitoIndicatore>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8SW5kaWNhdG9yZSBJU0VFPSIxMDAwMCIgeG1sbnM9Imh0dHA6Ly9pbnBzLml0L0lTRUVSaWZvcm1hIi8+Cg==</ns1:XmlEsitoIndicatore></ns1:ConsultazioneIndicatoreResult></ns1:ConsultazioneIndicatoreResponse>\n</s11:Body>\n</s11:Envelope>",
    "headers": {
      "Content-Type": "text/xml"
    }
  }
}