src/test/resources/stub/mappings/inps/ConsultazioneISEEFaultMessage.json

{
  "priority": "1",
  "request": {
    "method": "POST",
    "urlPathPattern": "/inps/isee",
    "headers": {
      "SOAPAction": {
        "equalTo": "\"http://inps.it/ConsultazioneISEE/ISvcConsultazione/ConsultazioneIndicatore\""
      }
    },
    "bodyPatterns": [
      {
        "equalToXml": "<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Header><ns3:Identity xmlns:ns2=\"http://inps.it/ConsultazioneISEE\" xmlns:ns3=\"http://inps.it/\"><UserId>OperationBatchIDPay</UserId><CodiceUfficio>001</CodiceUfficio></ns3:Identity></S:Header><S:Body><ns2:ConsultazioneIndicatore xmlns:ns2=\"http://inps.it/ConsultazioneISEE\" xmlns:ns3=\"http://inps.it/\"><ns2:request><ns2:TipoIndicatore>Ordinario</ns2:TipoIndicatore><ns2:RicercaCF><ns2:CodiceFiscale>CF_INPS_FAULT_MESSAGE</ns2:CodiceFiscale><ns2:PrestazioneDaErogare>A1.01</ns2:PrestazioneDaErogare><ns2:ProtocolloDomandaEnteErogatore>Protocol</ns2:ProtocolloDomandaEnteErogatore><ns2:StatodomandaPrestazione>Da Erogare</ns2:StatodomandaPrestazione></ns2:RicercaCF></ns2:request></ns2:ConsultazioneIndicatore></S:Body></S:Envelope>"
      }
    ]
  },
  "response": {
    "status": "200",
    "body": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Body><SOAP-ENV:Fault><faultcode>SOAP-ENV:Server</faultcode><faultstring>Request service/operation version not supported</faultstring><faultactor>Server</faultactor><detail><ns0:serviceException xmlns:ns0=\"http://www.example.com/facade/interface/v1_1\"><ns1:message xmlns:ns1=\"http://www.example.com/common/v1_3\">InternalCode01</ns1:message><ns1:text xmlns:ns1=\"http://www.example.com/common/v2_1\">Request service/operation version not supported</ns1:text></ns0:serviceException></detail></SOAP-ENV:Fault></SOAP-ENV:Body></SOAP-ENV:Envelope>",
    "headers": {
      "Content-Type": "text/xml"
    }
  }
}